In [1]:
import statsmodels
from statsmodels import stats
from statsmodels.stats import weightstats
from scipy.stats import t,norm
import numpy as np
import pandas as pd
import  statsmodels.api as sm
from statsmodels.formula.api import ols
import statsmodels.stats.multicomp
from statsmodels.stats.multicomp import pairwise_tukeyhsd
from statsmodels.stats import proportion
from scipy.stats import chisquare,chi2_contingency
import scipy
from scipy import stats
import pylab
from pylab import plot,show,legend,title,xlabel,ylabel
import matplotlib.pyplot as plt

import sklearn
from sklearn.model_selection import train_test_split
from mord import LogisticAT

In [2]:
df = pd.read_csv(r'E:\dbda khargar\Stats and R\foodhub_order.csv')

In [3]:
df.isnull().sum()

order_id                 0
customer_id              0
restaurant_name          0
cuisine_type             0
cost_of_the_order        0
day_of_the_week          0
rating                   0
food_preparation_time    0
delivery_time            0
dtype: int64

In [5]:
df.duplicated().sum()

0

In [6]:
df.dtypes

order_id                   int64
customer_id                int64
restaurant_name           object
cuisine_type              object
cost_of_the_order        float64
day_of_the_week           object
rating                    object
food_preparation_time      int64
delivery_time              int64
dtype: object

In [7]:
df.columns

Index(['order_id', 'customer_id', 'restaurant_name', 'cuisine_type',
       'cost_of_the_order', 'day_of_the_week', 'rating',
       'food_preparation_time', 'delivery_time'],
      dtype='object')

In [9]:
df.shape

(1898, 9)

In [10]:
print("Number of duplicated rows",df[df.duplicated()].shape)

Number of duplicated rows (0, 9)

In [11]:
df.count()

order_id                 1898
customer_id              1898
restaurant_name          1898
cuisine_type             1898
cost_of_the_order        1898
day_of_the_week          1898
rating                   1898
food_preparation_time    1898
delivery_time            1898
dtype: int64

In [13]:
df = df.drop_duplicates()

In [15]:
df.count()

order_id                 1898
customer_id              1898
restaurant_name          1898
cuisine_type             1898
cost_of_the_order        1898
day_of_the_week          1898
rating                   1898
food_preparation_time    1898
delivery_time            1898
dtype: int64

In [170]:
l = len(df.order_id)
l

1898

In [17]:
max(df.food_preparation_time)

35

In [18]:
min(df.food_preparation_time)

20

In [21]:
total = df.food_preparation_time.sum()
avg = total/l
avg

27.371970495258168

In [99]:
df.food_preparation_time.mean()

27.371970495258168

In [25]:
len(np.where(df['rating']=='Not given')[0])

736

In [45]:
rgroup = df.groupby(['restaurant_name']).size().reset_index(name='counts')

In [58]:
rg = rgroup.sort_values('counts')

In [61]:
rg.tail()

               restaurant_name  counts
109                       Parm      68
20   Blue Ribbon Fried Chicken      96
21           Blue Ribbon Sushi     119
153          The Meatball Shop     132
136                Shake Shack     219

In [66]:
q4=df.groupby(['day_of_the_week','cuisine_type']).size().reset_index(name='counts').sort_values('counts')

In [69]:
q4.iloc[np.where(q4['day_of_the_week']=='Weekend')[0]].tail()

   day_of_the_week cuisine_type  counts
22         Weekend      Mexican      53
15         Weekend      Chinese     163
18         Weekend      Italian     207
19         Weekend     Japanese     335
14         Weekend     American     415

In [171]:
cnt=df.iloc[np.where(df['cost_of_the_order']>20)[0]].count()
cnt

order_id                 555
customer_id              555
restaurant_name          555
cuisine_type             555
cost_of_the_order        555
day_of_the_week          555
rating                   555
food_preparation_time    555
delivery_time            555
total_time               555
dtype: int64

In [84]:
(cnt/df.size)*100

order_id                 3.249034
customer_id              3.249034
restaurant_name          3.249034
cuisine_type             3.249034
cost_of_the_order        3.249034
day_of_the_week          3.249034
rating                   3.249034
food_preparation_time    3.249034
delivery_time            3.249034
dtype: float64

In [95]:
cntcust=df.groupby('customer_id').size().reset_index(name='num_counts').sort_values('num_counts',ascending=False)
cntcust.iloc[:3]

     customer_id  num_counts
116        52832          13
84         47440          10
333        83287           9

In [105]:
rating_rest=df.groupby(['restaurant_name','rating']).size().reset_index(name='ratings_counts').sort_values('ratings_counts',ascending=False)

In [108]:
rating_rest

       restaurant_name     rating  ratings_counts
310        Shake Shack  Not given              86
309        Shake Shack          5              60
350  The Meatball Shop          5              53
308        Shake Shack          4              50
351  The Meatball Shop  Not given              48
..                 ...        ...             ...
123    El Parador Cafe          5               1
283          Rye House          4               1
122      DuMont Burger  Not given               1
121      DuMont Burger          5               1
0           'wichcraft          5               1

[415 rows x 3 columns]

In [109]:
rating_rest.iloc[np.where((rating_rest['ratings_counts']>50) & (rating_rest.ratings_counts.mean()>4))[0]]

       restaurant_name     rating  ratings_counts
310        Shake Shack  Not given              86
309        Shake Shack          5              60
350  The Meatball Shop          5              53

In [122]:
df2015 = df.iloc[np.where(df['cost_of_the_order']>20)[0]]
df15 = df.iloc[np.where(df['cost_of_the_order']>5)[0]]
totalrev = (df2015.cost_of_the_order.sum()*0.25)+(df15.cost_of_the_order.sum()*0.15)
totalrev

8379.539499999999

In [111]:
df.count()

order_id                 1898
customer_id              1898
restaurant_name          1898
cuisine_type             1898
cost_of_the_order        1898
day_of_the_week          1898
rating                   1898
food_preparation_time    1898
delivery_time            1898
dtype: int64

In [123]:
df['total_time'] = df.food_preparation_time + df.delivery_time

In [127]:
df.iloc[np.where(df['total_time']>60)[0]].count()

order_id                 200
customer_id              200
restaurant_name          200
cuisine_type             200
cost_of_the_order        200
day_of_the_week          200
rating                   200
food_preparation_time    200
delivery_time            200
total_time               200
dtype: int64

In [128]:
200/1898*100

10.537407797681771

In [138]:
weekday=df.groupby('day_of_the_week')

In [158]:
x1=weekday.get_group('Weekend')['delivery_time']

In [159]:
x2=weekday.get_group('Weekday')['delivery_time']

In [155]:
from statsmodels import stats
from statsmodels.stats import weightstats
from scipy.stats import t,norm

In [160]:
statsmodels.stats.weightstats.ztest(x2,x1, value=0,alternative='two-sided')

(27.559138130580667, 3.43915366959448e-167)

In [202]:
nonull = df[df['rating']!='Not given']
nonull['rating']=nonull['rating'].astype(int)
nonull

C:\Users\dheem\AppData\Local\Temp\ipykernel_20648\2658915490.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  nonull['rating']=nonull['rating'].astype(int)

,order_id,customer_id,restaurant_name,cuisine_type,cost_of_the_order,day_of_the_week,rating,food_preparation_time,delivery_time,total_time
2,1477070,66393,Cafe Habana,Mexican,12.23,Weekday,5,23,28,51
3,1477334,106968,Blue Ribbon Fried Chicken,American,29.20,Weekend,3,25,15,40
4,1478249,76942,Dirty Bird to Go,American,11.59,Weekday,4,25,24,49
5,1477224,147468,Tamarind TriBeCa,Indian,25.22,Weekday,3,20,24,44
7,1477859,89574,Barbounia,Mediterranean,5.97,Weekday,3,33,30,63
...,...,...,...,...,...,...,...,...,...,...
1889,1478190,94152,RedFarm Broadway,Chinese,8.68,Weekday,3,33,30,63
1890,1477316,164776,TAO,Japanese,15.67,Weekend,5,20,22,42
1893,1476701,292602,Chipotle Mexican Grill $1.99 Delivery,Mexican,22.31,Weekend,5,31,17,48
1894,1477421,397537,The Smile,American,12.18,Weekend,5,31,19,50
1896,1477513,64151,Jack's Wife Freda,Mediterranean,12.18,Weekday,5,23,31,54

In [203]:
nonull.dtypes

order_id                   int64
customer_id                int64
restaurant_name           object
cuisine_type              object
cost_of_the_order        float64
day_of_the_week           object
rating                     int32
food_preparation_time      int64
delivery_time              int64
total_time                 int64
dtype: object

In [169]:
import statsmodels
from statsmodels import stats
from statsmodels.stats import weightstats
from scipy.stats import t,norm
import numpy as np
import pandas as pd
import  statsmodels.api as sm
from statsmodels.formula.api import ols
import statsmodels.stats.multicomp
from statsmodels.stats.multicomp import pairwise_tukeyhsd
from statsmodels.stats import proportion
from scipy.stats import chisquare,chi2_contingency
import scipy
from scipy import stats
import pylab
from pylab import plot,show,legend,title,xlabel,ylabel
import matplotlib.pyplot as plt

import sklearn
from sklearn.model_selection import train_test_split
from mord import LogisticAT

In [211]:
ndf=nonull[['rating','cuisine_type','cost_of_the_order','day_of_the_week']]

In [212]:
day_dummy = pd.get_dummies(ndf['day_of_the_week'],drop_first=True).astype(int)
ndf=ndf.drop(['day_of_the_week'],axis=1)
ndf = pd.concat([ndf,day_dummy],axis=1)
ndf

      rating   cuisine_type  cost_of_the_order  Weekend
2          5        Mexican              12.23        0
3          3       American              29.20        1
4          4       American              11.59        0
5          3         Indian              25.22        0
7          3  Mediterranean               5.97        0
...      ...            ...                ...      ...
1889       3        Chinese               8.68        0
1890       5       Japanese              15.67        1
1893       5        Mexican              22.31        1
1894       5       American              12.18        1
1896       5  Mediterranean              12.18        0

[1162 rows x 4 columns]

In [213]:
cuisine_dummy = pd.get_dummies(ndf['cuisine_type'],drop_first=True).astype(int)
ndf=ndf.drop(['cuisine_type'],axis=1)
ndf = pd.concat([ndf,cuisine_dummy],axis=1)
ndf

,rating,cost_of_the_order,Weekend,Chinese,French,Indian,Italian,Japanese,Korean,Mediterranean,Mexican,Middle Eastern,Southern,Spanish,Thai,Vietnamese
2,5,12.23,0,0,0,0,0,0,0,0,1,0,0,0,0,0
3,3,29.20,1,0,0,0,0,0,0,0,0,0,0,0,0,0
4,4,11.59,0,0,0,0,0,0,0,0,0,0,0,0,0,0
5,3,25.22,0,0,0,1,0,0,0,0,0,0,0,0,0,0
7,3,5.97,0,0,0,0,0,0,0,1,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1889,3,8.68,0,1,0,0,0,0,0,0,0,0,0,0,0,0
1890,5,15.67,1,0,0,0,0,1,0,0,0,0,0,0,0,0
1893,5,22.31,1,0,0,0,0,0,0,0,1,0,0,0,0,0
1894,5,12.18,1,0,0,0,0,0,0,0,0,0,0,0,0,0
1896,5,12.18,0,0,0,0,0,0,0,1,0,0,0,0,0,0

In [214]:
x_train,x_test,y_train,y_test = train_test_split(ndf.drop('rating',axis=1),ndf.rating,test_size=0.2)
x_train = sm.add_constant(x_train,prepend = False)
x_test = sm.add_constant(x_test,prepend = False)

In [215]:
y_train

785     4
175     5
1190    3
1296    5
1831    4
       ..
1871    4
240     5
309     4
829     5
1224    5
Name: rating, Length: 929, dtype: int32

In [216]:
mod = LogisticAT().fit(x_train,y_train)

In [ ]:
print(mod.summary())

In [218]:
x_train.head()

,cost_of_the_order,Weekend,Chinese,French,Indian,Italian,Japanese,Korean,Mediterranean,Mexican,Middle Eastern,Southern,Spanish,Thai,Vietnamese,const
785,12.23,1,0,0,1,0,0,0,0,0,0,0,0,0,0,1.0
175,20.18,1,0,0,0,0,0,0,1,0,0,0,0,0,0,1.0
1190,15.67,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1.0
1296,32.98,0,0,0,0,1,0,0,0,0,0,0,0,0,0,1.0
1831,33.37,1,0,0,0,0,1,0,0,0,0,0,0,0,0,1.0